In [1]:
'''
Pandas is  a data analysis and data manipulation tool
Data Transform
Data Cleaning
Data Analysis
 1D ->Series
 2D ->Dataframe
 '''

'\nPandas is  a data analysis and data manipulation tool\nData Transform\nData Cleaning\nData Analysis\n 1D ->Series\n 2D ->Dataframe\n '

In [7]:
import pandas as pd
data = pd.Series([1,2,3,4,5,6])
data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [11]:
dict_pd = pd.Series({
    'Name':'Ram',
    'Age':20,
    'Address':'Kathmandu'
})
dict_pd

Name             Ram
Age               20
Address    Kathmandu
dtype: object

In [49]:
two_d_list = pd.DataFrame([['Bob',20,'Kathmandu'],
                          ['Ram',22,'biratnagar'],
                          ['Hari',25,'Bhaktapur'],
                          ['Shyam',21,'Lalitpur'],
                          ['Gita',21,'Udayapur']],
                          columns= ['Name','Age','Address'],
                          index = ['a','b','c','d','e']
                         )

In [51]:
two_d_list

    Name  Age     Address
a    Bob   20   Kathmandu
b    Ram   22  biratnagar
c   Hari   25   Bhaktapur
d  Shyam   21    Lalitpur
e   Gita   21    Udayapur

In [53]:
data = pd.Series([1,2,3,4,5,6])

In [55]:
data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [57]:
data = pd.Series(
    [1,2,3,4,5,6],
    index = ['a','b','c','d','e','f']
)

In [59]:
data

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

loc and iloc

In [62]:
'''
loc ->location = slicing data through alphabetical value or column names
iloc ->integer location = slicing data through index of row and coloumn
'''

'\nloc ->location = slicing data through alphabetical value or column names\niloc ->integer location = slicing data through index of row and coloumn\n'

In [65]:
two_d_list

    Name  Age     Address
a    Bob   20   Kathmandu
b    Ram   22  biratnagar
c   Hari   25   Bhaktapur
d  Shyam   21    Lalitpur
e   Gita   21    Udayapur

In [79]:
two_d_list.loc['c':'e','Name':'Address']

    Name  Age    Address
c   Hari   25  Bhaktapur
d  Shyam   21   Lalitpur
e   Gita   21   Udayapur

In [83]:
two_d_list.loc[
['a','b'],
["Name","Address"]

]

  Name     Address
a  Bob   Kathmandu
b  Ram  biratnagar

In [85]:
two_d_list = pd.DataFrame([['Bob',20,'Kathmandu'],
                          ['Ram',22,'biratnagar'],
                          ['Hari',25,'Bhaktapur'],
                          ['Shyam',21,'Lalitpur'],
                          ['Gita',21,'Udayapur']],
                          columns= ['Name','Age','Address'],
                          
                         )

In [87]:
two_d_list

    Name  Age     Address
0    Bob   20   Kathmandu
1    Ram   22  biratnagar
2   Hari   25   Bhaktapur
3  Shyam   21    Lalitpur
4   Gita   21    Udayapur

In [89]:
data

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [91]:
df = {
    'Name':['Asus','Dell','Acer','Hp'],
    'Model':['Zenbook','Inspiron','Nitro','Notebook'],
    'year':[2016,2017,2020,2019],
    'Waranty':[1,2,3,1]
}

In [93]:
laptop = pd.DataFrame(df)
laptop

   Name     Model  year  Waranty
0  Asus   Zenbook  2016        1
1  Dell  Inspiron  2017        2
2  Acer     Nitro  2020        3
3    Hp  Notebook  2019        1

In [115]:
laptop.iloc[:,0:2]

   Name     Model
0  Asus   Zenbook
1  Dell  Inspiron
2  Acer     Nitro
3    Hp  Notebook

In [117]:
laptop.iloc[
[0,3],
[0,2]
]

   Name  year
0  Asus  2016
3    Hp  2019

In [123]:
employees = pd.read_csv("C:\\Users\\user\\Desktop\\DataScience\\Datas\\Employees.csv")

In [127]:
employees

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
106,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0
107,203,Susan,Mavris,SMAVRIS,515.123.7777,07.06.2002,HR_REP,6500,NaN,101.0,40.0
108,204,Hermann,Baer,HBAER,515.123.8888,07.06.2002,PR_REP,10000,NaN,101.0,70.0
109,205,Shelley,Higgins,SHIGGINS,515.123.8080,07.06.2002,AC_MGR,12008,NaN,101.0,110.0
110,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0

In [153]:
employees.size

1221

In [133]:
employees.shape

(111, 11)

In [137]:
employees.head(6)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,NaN,103.0,60.0

In [161]:
employees.tail()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
106,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0
107,203,Susan,Mavris,SMAVRIS,515.123.7777,07.06.2002,HR_REP,6500,NaN,101.0,40.0
108,204,Hermann,Baer,HBAER,515.123.8888,07.06.2002,PR_REP,10000,NaN,101.0,70.0
109,205,Shelley,Higgins,SHIGGINS,515.123.8080,07.06.2002,AC_MGR,12008,NaN,101.0,110.0
110,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0

In [141]:
employees

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
106,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0
107,203,Susan,Mavris,SMAVRIS,515.123.7777,07.06.2002,HR_REP,6500,NaN,101.0,40.0
108,204,Hermann,Baer,HBAER,515.123.8888,07.06.2002,PR_REP,10000,NaN,101.0,70.0
109,205,Shelley,Higgins,SHIGGINS,515.123.8080,07.06.2002,AC_MGR,12008,NaN,101.0,110.0
110,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0

In [149]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     111 non-null    int64
 1   FIRST_NAME      111 non-null    object
 2   LAST_NAME       111 non-null    object
 3   EMAIL           111 non-null    object
 4   PHONE_NUMBER    111 non-null    object
 5   HIRE_DATE       111 non-null    object
 6   JOB_ID          111 non-null    object
 7   SALARY          111 non-null    int64
 8   COMMISSION_PCT  35 non-null     float64
 9   MANAGER_ID      110 non-null    float64
 10  DEPARTMENT_ID   110 non-null    float64
dtypes: float64(3), int64(2), object(6)
memory usage: 9.7+ KB

In [155]:
employees.describe()

       EMPLOYEE_ID        SALARY  COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
count   111.000000    111.000000       35.000000  110.000000     110.000000
mean    154.855856   6560.576577        0.222857  124.845455      63.909091
std      31.953047   3891.443849        0.085184   21.729440      21.592364
min     100.000000   2100.000000        0.100000  100.000000      10.000000
25%     127.500000   3100.000000        0.150000  108.000000      50.000000
50%     155.000000   6400.000000        0.200000  122.000000      50.000000
75%     182.500000   9000.000000        0.300000  145.000000      80.000000
max     206.000000  24000.000000        0.400000  205.000000     110.000000

In [165]:
employees[[
    'EMPLOYEE_ID','SALARY']]

     EMPLOYEE_ID  SALARY
0            100   24000
1            101   17000
2            102   17000
3            103    9000
4            104    6000
..           ...     ...
106          206    8300
107          203    6500
108          204   10000
109          205   12008
110          206    8300

[111 rows x 2 columns]

In [171]:
employees.isnull().sum().sum()

78

In [173]:
employees.isnull()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,False,False,False,False,False,False,False,False,True,True,False
1,False,False,False,False,False,False,False,False,True,False,False
2,False,False,False,False,False,False,False,False,True,False,False
3,False,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...
106,False,False,False,False,False,False,False,False,True,False,False
107,False,False,False,False,False,False,False,False,True,False,False
108,False,False,False,False,False,False,False,False,True,False,False
109,False,False,False,False,False,False,False,False,True,False,False
110,False,False,False,False,False,False,False,False,True,False,False

In [175]:
employees.isnull().sum()

EMPLOYEE_ID        0
FIRST_NAME         0
LAST_NAME          0
EMAIL              0
PHONE_NUMBER       0
HIRE_DATE          0
JOB_ID             0
SALARY             0
COMMISSION_PCT    76
MANAGER_ID         1
DEPARTMENT_ID      1
dtype: int64

In [183]:
employees['EMPLOYEE_ID'].dtype

dtype('int64')